## Pandas DataFrames

In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [5]:
np.random.seed(101)

In [6]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df # a dataframe is a bunch of series that share the same index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Grabbing columns from a DataFrame

In [8]:
df['W'] # grab the W column/series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
type(df['W'])

pandas.core.series.Series

In [13]:
df[['W','Z']] # pass a list of columns, output is dataframe

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [25]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [17]:
df.drop('new', axis=1) # does not happen 
# axis = 0: rows
# axis = 1: columns

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [20]:
df # df.drop() does not happen in place, df is unaffected

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [26]:
df.drop('new', axis=1, inplace=True)

In [27]:
df # df is affected

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df.drop(['E'])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

Grabbing rows from a DataFrame: `df.loc[]` or `df.iloc[]`. N.B. the square brackets

In [30]:
df.loc['A'] # SQUARE BRACKETS, weird.

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [31]:
df.iloc[2] # index location

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [34]:
df.loc['B','X'] # selecting an element

-0.31931804459303326

In [35]:
df.iloc[0,0] # selecting an element with the index

2.706849839399938

In [37]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df.loc[['A','B'],['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [24]:
np.random.seed(101)
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df # a dataframe is a bunch of series that share the same index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df[df > 0] # conditional selection

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [57]:
resultdf = df[df['W'] > 0] # conditional selection
# output only rows where 'W' > 0
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df['W'][df['W'] > 0]

A    2.706850
B    0.651118
D    0.188695
E    0.190794
Name: W, dtype: float64

In [54]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [64]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [84]:
df[(df['W']>0) & (df['Y']>1)] # for multiple conditions you cannot use `and`

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

Bitwise AND operator in python: `&`

Example: 
- 12 -> 1100
- 5 ->  0101

and 
- 4 -> 0100

In [101]:
12 & 5

4

Bitwise AND operator in python: `|`

In [8]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df.reset_index() # resetting the index

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [14]:
df # not in place

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
newind = 'CA NY WY OR CO'.split() # quick way to create list
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [25]:
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [26]:
df.set_index('States', inplace=True) # setting a new index
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

### Multi-Index and Index Hierarchy

In [28]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [36]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1 -0.925874  1.862864
   2 -1.133817  0.610478
   3  0.386030  2.084019
G2 1 -0.376519  0.230336
   2  0.681209  1.035125
   3 -0.031160  1.939932

In [47]:
df.loc['G1'].loc[1] # call from the outside index, moving towards the inside

A   -0.925874
B    1.862864
Name: 1, dtype: float64

In [51]:
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1   -0.925874  1.862864
       2   -1.133817  0.610478
       3    0.386030  2.084019
G2     1   -0.376519  0.230336
       2    0.681209  1.035125
       3   -0.031160  1.939932

In [52]:
df.loc['G2'].loc[2]['B']

1.0351250747739213

In [53]:
df.loc['G1']

            A         B
Num
1   -0.925874  1.862864
2   -1.133817  0.610478
3    0.386030  2.084019

In [54]:
df.xs('G1') # cross section

            A         B
Num
1   -0.925874  1.862864
2   -1.133817  0.610478
3    0.386030  2.084019

In [58]:
df.xs('G1', level='Groups')

            A         B
Num
1   -0.925874  1.862864
2   -1.133817  0.610478
3    0.386030  2.084019

In [60]:
df.xs(1, level='Num') # we could not do that as easily with `.loc[]`

               A         B
Groups
G1     -0.925874  1.862864
G2     -0.376519  0.230336